[
	{
		"title": "Heterogeneous Liked Open Data Management",
		"start": "2012",
		"path": "/mlod",
		"img": "/images/researches/mlod.jpg",
		"description": ""
	},

	{
		"title": "Preprocessing-based Approaches for Imbalanced Classification",
		"start": "2020",
		"path": "/imbalance",
		"img": "/images/researches/imbalance.jpg",
		"description": "In classification, class imbalance is a factor that degrades the classification performance of many classification methods. Resampling is one widely accepted approach to the class imbalance; however, it still suffers from an insufficient data space, which also degrades performance. To overcome this, in this paper, an undersampling-based imbalanced classification framework, MMEnsemble, is proposed that incorporates metric learning into a multi-ratio undersampling-based ensemble. This framework also overcomes a problem with determining the appropriate sampling ratio in the multi-ratio ensemble method. It was evaluated by using 12 real-world datasets. It outperformed the state-of-the-art approaches of metric learning, undersampling, and oversampling in recall and ROC-AUC, and it performed comparably with them in terms of Gmean and F-measure metrics."
	},

	{
		"title": "Japanese Legal Data Management",
		"start": "2018",
		"path": "/legal",
		"img": "/images/researches/legal.jpg",
		"description": ""
	},

	{
		"title": "Faceted Search for Semi-structured Data",
		"start": "2009",
		"end": "2015",
		"path": "/faceted",
		"img": "/images/researches/faceted.jpg",
		"description": "Semi-structured data such as XML data have been used in various situations in order to reuse information not only in the services but also external applications. Utilizing semi-structured data is an important challenge. This research especially focuses on the exploration over semi-structured data. Faceted search is one of the promising exploratory search methods, therefore, this research applies faceted search to semi-structured data. In order to construct a faceted search system, this research works on four directions: (1) a framework to construct a faceted search system over XML data which is a tree-structured semi-structured data, (2) the extended framework for graph-structured semi-structured data, (3) an automation scheme for extracting necessary information, and (4) utilization of textual contents in semi-structured data."
	}
]
